announcements/managing-feeds.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Managing And Accessing Feeds  On The Emacspeak Audio Desktop</title>
<!-- 2013-12-29 Sun 08:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Managing And Accessing Feeds  On The Emacspeak Audio Desktop</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Managing And Accessing Feeds  On The Emacspeak Audio Desktop</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Summary</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Feature <b>emacspeak-feeds</b> enables rapid access to managing and
accessing Atom, RSS and OPML feeds. Feeds can be browsed from a
dedicated buffer, or accessed via minibuffer completion for
oft-accessed feeds. Feeds are stored as a user customizable
option, and can be added and deleted either via Emacs' customize
interface or directly via interactive Emacs commands.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How It Works</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The list of subscribed feeds is stored in variable
<span class="underline">emacspeak-feeds</span> which is managed via Emacs' <span class="underline">customize</span>
interface. Each entry this list contains a label for the feed,
the feed URL, and the type of the feed (<sub>rss</sub>_, <span class="underline">atom</span>, or
<span class="underline">opml</span>).
</p>

<p>
Interactive command  <span class="underline">emacspeak-webspace-feed-reader</span> opens a
buffer containing the list of subscribed feeds; feeds can be
opened by pressing <span class="underline">enter</span> on the relevant feed. 
</p>

<p>
Oft-accessed feeds can be opened directly via command
<span class="underline">emacspeak-feed-browse</span> bound to <span class="underline">C-e C-u</span> — this command prompts
for a feed label with minibuffer completion.
</p>

<p>
Feeds can be added or deleted by customizing <span class="underline">emacspeak-feeds</span>
via Emacs' <span class="underline">M-x customize-variable</span> — bound by default in
emacspeak to <span class="underline">C-h V</span>. Alternatively, interactive command
<span class="underline">emacspeak-feed-add-feed</span> bound to <span class="underline">C-e M-u</span> can be used to
subscribe to feeds. Note that both methods result in the
subscribed feed being stored in <span class="underline">emacspeak-feeds</span>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2013-12-29 Sun&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2013-12-29 Sun 08:34</p>
<p class="creator">Emacs 24.3.50.2 (Org mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
